/*考虑到一共五个人，直接模拟推理有些太难，计算机最擅长的遍历此时就会派上用场，
将每个人从第1到第5来一遍，则一共会产生5^5种可能性，这个只需要一个5层循环即可
搞定。但是这样会导致一些不期望出现的结果出现，因为我并没有查重，所以会出现两
个人抢名次的情况，也就是两个人或者更多的人名次相同的情况，例如两个第二，三个
第三这样的，所以即使满足了条件，也要查看一下五个人的名次是否重复，这个交给一
个函数来执行，只要五个人名次并列，那就返回0，否则返回1即可。有了这个思路，就
能完成以下代码。*/
#include<stdio.h>
int main()
{
	int p[5]; 

	for (p[0] = 1; p[0] <= 5; p[0]++)
	{
		for (p[1] = 1; p[1] <= 5; p[1]++)
		{
			for (p[2] = 1; p[2] <= 5; p[2]++)
			{
				for (p[3] = 1; p[3] <= 5; p[3]++)
				{
					for (p[4] = 1; p[4] <= 5; p[4]++) 
					{
						if ((15 == (p[0] + p[1] + p[2] + p[3] + p[4])) && (120 == (p[0] * p[1] * p[2] * p[3] * p[4])))
						{
							if ((p[1] == 2) + (p[0] == 3) == 1 && 
								(p[1] == 2) + (p[4] == 4) == 1 && 
								(p[2] == 1) + (p[3] == 2) == 1 && 
								(p[2] == 5) + (p[3] == 3) == 1 &&
								(p[4] == 4) + (p[0] == 1) == 1)
													{
														for (int i = 0; i < 5; i++)
														{
															printf("%d ", p[i]);
														}
														putchar('\n');
													}
						}
						
					}
				}
			}
		}
	}
	return 0;
}
	